bench/pgbench-compare/results/20260516_070238_goopg_c25_j25_select-only.txt
pgbench (18.3)
starting vacuum...end.
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 25
number of threads: 25
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 39807
number of failed transactions: 0 (0.000%)
latency average = 6.281 ms
latency stddev = 7.857 ms
initial connection time = 2.649 ms
tps = 3976.994237 (without initial connection time)