bench/pgbench-compare/results/20260516_070238_goopg_c50_j50_simple-update.txt
pgbench (18.3)
starting vacuum...end.
transaction type: <builtin: simple update>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 4612
number of failed transactions: 0 (0.000%)
latency average = 108.917 ms
latency stddev = 27.111 ms
initial connection time = 4.862 ms
tps = 456.735999 (without initial connection time)