bench/pgbench-compare/results/20260522_142101_goopg_simple-update.txt
pgbench (18.3)
starting vacuum...end.
pgbench: error: client 4 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 7 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 6 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 5 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 8 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 9 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 0 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 1 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 3 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
pgbench: error: client 2 script 0 aborted in command 6 query 0: ERROR:  DecodePhysicalPGRow: filler: truncated varlena
transaction type: <builtin: simple update>
scaling factor: 100
query mode: simple
number of clients: 10
number of threads: 2
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 1807
number of failed transactions: 0 (0.000%)
latency average = 53.460 ms
initial connection time = 2.343 ms
tps = 187.056653 (without initial connection time)
pgbench: error: Run was aborted; the above results are incomplete.